Autodesk.Revit.DB.LeaderEndCondition
An enumerated type listing leader end conditions that are supported for IndependentTags.
Remarks:
The leader end point is the point on the leader which is closest to the tagged element.

Autodesk.Revit.DB.LeaderEndCondition.Free
The leader end point can be freely positioned by the user.

Autodesk.Revit.DB.LeaderEndCondition.Attached
Revit automatically keeps the leader end point attached to the tagged element.